[
  {
    "path": "posts/2021-08-10-function/",
    "title": "Using `ggplot` to Explore Palmer Penguins Datasets",
    "description": "This blog post has graphs from the palmer penguins dataset.",
    "author": [
      {
        "name": "Paloma Cartwright",
        "url": {}
      }
    ],
    "date": "2021-08-10",
    "categories": [],
    "contents": "\nExploring Palmer Penguins\nThis is a graph using ggplot to display the flipper length and body mass relation of the palmer penguins dataset.\n\n\n\n\n\n\n",
    "preview": "posts/2021-08-10-function/images/lter_penguins.png",
    "last_modified": "2021-08-10T10:42:59-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-10-hello/",
    "title": "My First Blog Post",
    "description": "First blog post for this website.",
    "author": [
      {
        "name": "Paloma Cartwright",
        "url": {}
      }
    ],
    "date": "2021-08-10",
    "categories": [],
    "contents": "\nI will add actual information later, but for now, enjoy this hippie ipsum.\nAcaiberries gojiberries acid LSD ayahuasca acroyoga activatedcharcoal acunpuncture innatecapacity co-create, cleansing spiritualawakening hackysack lifecoach soulmate continuum aries. LSD conflictresolution indigenouselders mayancalendar manifestation discoveringvaluabletruths synchronicity plantconsciousness, embracingandmovingtowards prius backjack innatecapacity trippingon short-grainbrownrice entheogen, ganja reprogrammingyourDNA deeptissue kefir ayahuasca humanpotential. Impermanent acunpuncture sciencehasproventhat herbaltea honoringyourtruth breathwork ponytail somatic firetending, thebuddha toendsuffering empoweringmessages whitesage worldpeace maypole. Cleansing toendsuffering rawthenticself quinoa shanti reflexology familyconstellation withadashofcayennepepper, ponytail kirtan personaldevelopment all-natural coldplunge shakti, thepowerofintention bodyworker fertilityawareness indigenouselders radicalacceptance nonprofit salvia, shiva pisces mastercleanse astrological ritesofpassage. Pittaimbalance thedalilama raindance giftingcircle authenticself sungazing, cuddleparty open-minded sharing craniosacraltherapy feelingtriggered, shamanicceremony equinox holdingspace quinoa.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-08-10T10:31:59-07:00",
    "input_file": {}
  }
]
