[
  {
    "path": "posts/2021-11-24-hurricanes-and-gdp-growth-in-the-bahamas/",
    "title": "Hurricanes and GDP Growth in The Bahamas",
    "description": "EDS 222 Final Project: Exploring the statistical relationship between Hurricanes and the Annual Percentage of   GDP Growth in The Bahamas.",
    "author": [
      {
        "name": "Paloma Cartwright",
        "url": {}
      }
    ],
    "date": "2021-12-02",
    "categories": [
      "R",
      "statistics",
      "tidyverse",
      "kable"
    ],
    "contents": "\n\nContents\nResearch Question\nData Collection and Tidying\nGDP Growth Data\nHurricane Data\n\nAnalysis\nPlan\nResults\nTest 1\nTest 2\nTest 3\n\n\nConclusion and Next Steps\nGithub\nReferences\n\nResearch Question\nThe aim of this project is to investigate the impact of hurricanes on the annual percentage of GDP growth in The Bahamas. Growing up in The Bahamas, I have witnessed first hand the devastating impacts of hurricanes on livelihoods throughout the country and have been an active participant in recovery efforts every time my island was struck. Natural disasters have massive economic costs and take a deep toll on growth prospects because reconstruction costs monopolize already scarce resources for health, education, and social spending, especially in developing countries (Ötker & Srinivasan, 2018). There is existing research on the impact of hurricanes on GDP growth in the United States but this project will look specifically at The Bahamas. With the global changing climate and the continual impact of stronger hurricanes on Caribbean countries, answering this question can have important implications for the future of small island developing states like The Bahamas.\nData Collection and Tidying\nGDP Growth Data\nThe data for annual percentage of GDP Growth was collected from The World Bank Data Repository (World Bank, 2021). This data covers annual percentage of GDP growth from 1961 to present for The Bahamas. The metadata containing information about calculations and sampling strategy can be found here.\n\n\nShow code\n\ngdp_growth <- read_csv(here(\"_posts\", \"2021-11-24-hurricanes-and-gdp-growth-in-the-bahamas\", \"final_proj_data\", \"bah_yearly_gdp_growth.csv\")) %>% \n  rename(\"country_name\" = \"Country Name\") %>% \n  filter(country_name == \"Bahamas, The\") %>% \n  select(-\"Indicator Name\") %>% \n  pivot_longer(cols = 2:62, \n               names_to = \"year\", \n               values_to = \"gdp_growth\") %>% \n  mutate(year = as.numeric(year))\n\n\n\n\n\nShow code\n\nggplot(data = gdp_growth, aes(x = year, y = gdp_growth)) +\n  geom_line(color = \"lightblue\") +\n  geom_point(color = \"blue\") +\n  labs(x = \"Year\", \n       y = \"Annual % GDP Growth\", \n       title = \"Yearly Percentage of GDP Growth for The Bahamas\") +\n  theme_classic() +\n  theme(plot.title = element_text(hjust = 0.5))\n\n\n\n\nFigure 1: Yearly Pecentage of GDP Growth for The Bahamas from 1960 to 2020 shows a slight downward trend with some years not following the general trend in the form of a large spike in either the positive or negative direction.\n\n\n\nHurricane Data\nThe data on hurricanes in The Bahamas was collected from the National Hurricane Center’s Data Archive (National Hurricane Center, 2021a). This dataset did not exist in csv format, so I looked through the yearly reports from 1960 to present and recorded all of the storms that impacted The Bahamas. I made note of the year each storm occurred, the name of the storm, the intensity and the number of islands in The Bahamas that were impacted by each storm.\nIn creation of this dataset, I recorded storm intensity from 1 to 6, with 1 being Tropical Storms and 6 being a category 5 hurricane. The Saffir-Simpson Wind Scale considers a tropical storm anything with winds below 74mph (National Hurricane Center, 2021b), but I know from personal experience that these storms can still have damaging impacts on countries so I wanted to ensure they were included in the data to be analyzed for this question.\n\n\nShow code\n\nstorms <- read_csv(here(\"_posts\", \"2021-11-24-hurricanes-and-gdp-growth-in-the-bahamas\", \"final_proj_data\", \"bahamas_hurricanes.csv\"))\n\nyr_storms <- storms %>% \n  group_by(year) %>%\n  summarize(number = n(), \n            avg_strength = mean(category)) %>% \n  add_row(year = c(1962, 1964, 1967, 1968, 1969, 1971, \n                   1974, 1975, 1976, 1977, 1978, 1980, \n                   1982, 1983, 1986, 1989, 1990, 1993, \n                   1994, 1997, 2000, 2009), number = 0, avg_strength = 0) %>% \n  arrange(year)\n\nyearly <- ggplot(data = yr_storms, aes(x = year, y = number)) +\n  geom_point(color = \"blue\") + \n  labs(x = \"Year\", \n       y = \"Number\", \n       title = \"Yearly Number of Storms to Impact the Bahamas\") +\n  theme_minimal() +\n  theme(plot.title = element_text(hjust = 0.5)) \n\nyearly\n\n\n\n\nFigure 2: The yearly number of storms to impact The Bahamas from 1960-2020 has fluctuated between 0 and 6 storms.\n\n\n\n\n\nShow code\n\n# To complete my analysis, I had to combine the GDP growth dataset with the Hurricane dataset.\nhgdp <- full_join(gdp_growth, yr_storms, by = 'year') %>% \n  mutate(num_yr1 = lag(number, n = 1, default = NA)) %>% \n  mutate(num_yr2 = lag(number, n = 2, default = NA)) %>% \n  rename(num_yr0 = number)\n\n\n\nAnalysis\nPlan\nFor this analysis I going to first look at a linear regression of the impact of yearly number hurricanes on annual percentage of GDP growth. I decided to use linear regression to first see if there was an immediate effect of hurricanes on percentage of GDP growth.\nBecause I have data on the yearly number of hurricanes, I have the capability of looking at the lagged effect by year. I am interested in this because the hurricane season is June 1st to November 30th, so the impact of a late season storm might not be seen immediately. Additionally, the rebuilding process after a storm is slow so it can take a while for the progress to be seen. This means I will look at the number of hurricanes in the current year, and with a one and two year lag to see if there is a statistically significant impact of these. I will also look at the potential of a lagged dependent variable. I will use an auto correlation function to determine if the model is biased or inefficient using the dwtest().\nThe biggest limitation in answering my research question is the known fact that more than the impact of hurricanes affect the annual GDP growth of The Bahamas so there is a likely chance that my results will be inconclusive and my OLS assumptions will be violated.\nResults\nTest 1\nThe first linear regression model is \\(gdpgrowth_i = \\beta_0 + \\beta_1 numstorms_i + u_i\\).\n\n\nShow code\n\ngdp_num_strength <- lm(gdp_growth ~ num_yr0, data = hgdp) %>%\n  summary() %>% \n  xtable() %>% \n  kable(digits = 3, \n        caption = \"Linear Regression of Number of Hurricanes on Annual Percentage GDP Growth\") %>%\n  kable_styling(latex_options = \"HOLD_position\")\n\nmod <- lm(gdp_growth ~ num_yr0, data = hgdp)\ngdp_num_strength\n\n\n\nTable 1: Linear Regression of Number of Hurricanes on Annual Percentage GDP Growth\n\n\n\n\nEstimate\n\n\nStd. Error\n\n\nt value\n\n\nPr(>|t|)\n\n\n(Intercept)\n\n\n4.181\n\n\n1.272\n\n\n3.288\n\n\n0.002\n\n\nnum_yr0\n\n\n-1.032\n\n\n0.713\n\n\n-1.448\n\n\n0.153\n\n\nThis linear regression tells us that the annual percentage of GDP growth in The Bahamas without the impact of Hurricanes is 4.18. With an increase in number of hurricanes per year by 1, the annual percentage of GDP Growth decreases by -1.03. The p-value for this linear regression is greater than 0.05 so we fail to reject the null hypothesis that there is no impact of the number hurricanes on GDP growth.\n\n\nShow code\n\nyr0 <- hgdp %>% \n  ggplot(aes(y = gdp_growth, x = num_yr0)) +\n  geom_point() +\n  stat_smooth(method = \"lm\", se = FALSE) + \n  labs(x = \"Average Number of Storms\",\n       y = \"Annual % GDP Growth\",\n       title = \"Regression of Yearly GDP Growth and Number of Storms\") +\n  theme_minimal()\n\nyr0\n\n\n\n\nFigure 3: Linear regression of yearly percentage of GDP Growth and the number of storms that impacted The Bahamas shows a negative correlation.\n\n\n\nTest 2\nThe second linear regression I tested was the impact of the one year and two year lag on the time series model.\n\\(gdpgrowth_t = \\beta_0 + \\beta_1 numstorms_t + \\beta_1 numstorms_{t-1} + \\beta_1 numstorms_{t-2} + u_t\\)\n\n\nShow code\n\ngdp <- ts(hgdp$gdp_growth, start=1960)\nyr0<-ts(hgdp$num_yr0,start=1960)\n\nyear_lag_mod <- dynlm(gdp ~ L(yr0, 0:2))\nyear_lag_mod %>%\n  summary() %>% \n  xtable() %>% \n  kable(digits = 3, \n        caption = \"Multiple Linear Regression of Number of Hurricanes on Annual Percentage GDP Growth with a Two Year Lag Effect\") %>% \n  kable_styling(latex_options = \"HOLD_position\")\n\n\n\nTable 2: Multiple Linear Regression of Number of Hurricanes on Annual Percentage GDP Growth with a Two Year Lag Effect\n\n\n\n\nEstimate\n\n\nStd. Error\n\n\nt value\n\n\nPr(>|t|)\n\n\n(Intercept)\n\n\n5.249\n\n\n1.576\n\n\n3.331\n\n\n0.002\n\n\nL(yr0, 0:2)zoo(coredata(x), tt).1\n\n\n-0.724\n\n\n0.739\n\n\n-0.979\n\n\n0.332\n\n\nL(yr0, 0:2)zoo(coredata(x), tt).2\n\n\n-0.285\n\n\n0.758\n\n\n-0.376\n\n\n0.709\n\n\nL(yr0, 0:2)zoo(coredata(x), tt).3\n\n\n-1.075\n\n\n0.770\n\n\n-1.396\n\n\n0.168\n\n\nShow code\n\nyear_lag_mod_test <- dwtest(year_lag_mod)\n\n\n\nThe p-values in this linear regression were not significant enough in any of the scenarios to reject the null hypothesis, so they all failed to reject. The p-value for the two year lag was the lowest so it had more power but was still not lower the 0.05 significance level. Also, the Adjusted R-squared value was 0.02 which means the explanatory power from the number of storms is very low, only 2%.\nWhen running the dwtest() on the year lag model, there was a p-value of 0.0026 which is less than 0.05. This means that we can reject the null hypothesis and conclude that the residuals in the regression are auto-correlated with the explanatory variables. This means the errors are correlated which makes OLS biased.\n\n\nShow code\n\nyr0 <- hgdp %>% \n  ggplot(aes(y = gdp_growth, x = num_yr0)) +\n  geom_point() +\n  stat_smooth(method = \"lm\", se = FALSE) + \n  labs(x = \"Average Number of Storms\",\n       y = \"Annual % GDP Growth\", \n       title =\"Year 0\") + \n  theme_minimal()\n\nyr1 <- hgdp %>% \n  ggplot(aes(y = gdp_growth, x = num_yr1)) +\n  geom_point() +\n  stat_smooth(method = \"lm\", se = FALSE) + \n  labs(x = \"Average Number of Storms\",\n       y = \"Annual % GDP Growth\", \n       title = \"Lag Year 1\") + \n  theme_minimal()\n\nyr2 <- hgdp %>% \n  ggplot(aes(y = gdp_growth, x = num_yr2)) +\n  geom_point() +\n  stat_smooth(method = \"lm\", se = FALSE) + \n  labs(x = \"Average Number of Storms\",\n       y = \"Annual % GDP Growth\", \n       title = \"Lag Year 2\") + \n  theme_minimal()\n\n\nyr0 | yr1 | yr2 \n\n\n\n\nFigure 4: Linear regression of yearly percentage of GDP Growth and the number of storms that impacted The Bahamas shows a negative correlation. The largest negative correlation is seen in the graph with a 2 year lag effect\n\n\n\nTest 3\nThe third regression I completed for my time series OLS was \\(gdpgrowth_t = \\beta_0 + \\beta_1 numstorms_t + \\beta_1 gdpgrowth_{t-1} + \\beta_1 numstorms_{t-1} + \\beta_1 gdpgrowth_{t-2} + \\beta_1 numstorms_{t-2} + u_t\\).\n\n\nShow code\n\ngdp <- ts(hgdp$gdp_growth, start=1960)\nyr0<-ts(hgdp$num_yr0,start=1960)\nyear_gdp_lag_mod <- dynlm(gdp ~ L(yr0, 0) + L(gdp, 1) + L(yr0, 1) + L(gdp, 2) + L(yr0, 2))\nyear_gdp_lag_mod %>% \n  summary() %>% \n  xtable() %>% \n  kable(digits = 3, \n        caption = \"Multiple Linear Regression of Number of Hurricanes on Annual Percentage GDP Growth with a Year Lag and a GDP Lag\") %>%\n  kable_styling(latex_options = \"HOLD_position\")\n\n\n\nTable 3: Multiple Linear Regression of Number of Hurricanes on Annual Percentage GDP Growth with a Year Lag and a GDP Lag\n\n\n\n\nEstimate\n\n\nStd. Error\n\n\nt value\n\n\nPr(>|t|)\n\n\n(Intercept)\n\n\n3.643\n\n\n1.691\n\n\n2.154\n\n\n0.036\n\n\nL(yr0, 0)\n\n\n-0.457\n\n\n0.727\n\n\n-0.629\n\n\n0.532\n\n\nL(gdp, 1)\n\n\n0.345\n\n\n0.145\n\n\n2.374\n\n\n0.021\n\n\nL(yr0, 1)\n\n\n-0.173\n\n\n0.738\n\n\n-0.235\n\n\n0.815\n\n\nL(gdp, 2)\n\n\n-0.034\n\n\n0.144\n\n\n-0.234\n\n\n0.816\n\n\nL(yr0, 2)\n\n\n-1.017\n\n\n0.747\n\n\n-1.362\n\n\n0.179\n\n\nWhen interpreting the p-values in this multiple linear regression, there is a p-value of 0.021 which is less than 0.05 for a 1 year lag in GDP which means this rejects the null hypothesis that there is no relationship between GDP growth in the current year and GDP growth in the previous. The remainder of the variables in this regression model are not statistically significant and they failed to reject the null hypothesis.\nConclusion and Next Steps\nBased on the findings of my complete analysis, the impact of hurricanes on the annual percentage of GDP growth can not be determined simply by the explanatory variables chosen. When looking at how low the r squared values are for my linear regressions, it is clear that these models are not a good measure of the impact on GDP and further analysis should be done.\nIf I had more time to conduct this further analysis, I would look at other contributing factors to GDP growth in The Bahamas and try to identify some of the possible omitted variable bias. The link between annual percentage of GDP growth and storm intensity and population impacted would be analyzed. Because The Bahamas is an archipelago of 17 major inhabited islands, often hurricanes will only impact a few of them. Larger islands have more infrastructure so damages can be more costly. Looking at the number of islands and the population impacted by a hurricane might lead to a more definitive answer about the impact of hurricanes on the annual percentage of GDP growth. In this further analysis, I can also look at the cost of damages of each storm and compare that to the annual percentage of GDP growth. This would be another good metric for determining the impact of storms as they can both be mesured on a US dollar scale. Finally, I would examine how to separate the impact of Covid-19 on annual percentage of GDP growth. I considered removing 2020 from the datasets because there was a very large decrease in percentage GDP growth. However in 2019, The Bahamas was hit with the worst hurricane on record. Dorian destroyed two islands and resulted in 3.4 billion dollars in damages, over 25% of The Bahamas’ GDP (Inter American Development Bank, 2019). As shown in my second hypothesis test, there is a lag effect on the impact on GDP. Removing the years following the impact of Hurricane Dorian would cause inaccuracies in the study.\nGithub\nThe repository containing all of the code and data for this analysis can be found here.\nReferences\nInter American Development Bank. (2019, November 15). Damages and other impacts on Bahamas by Hurricane Dorian estimated at $3.4 billion: Report | IADB. https://www.iadb.org/en/news/damages-and-other-impacts-bahamas-hurricane-dorian-estimated-34-billion-report\nNational Hurricane Center. (2021a). NHC Data Archive. https://www.nhc.noaa.gov/data/\nNational Hurricane Center. (2021b, May). Saffir-Simpson Hurricane Wind Scale. https://www.nhc.noaa.gov/aboutsshws.php\nÖtker, İ., & Srinivasan, K. (2018). For the Caribbean, building resilience is a matter of survival. Finance and Development, 55(1), 4.\nWorld Bank. (2021). GDP growth (annual %)—Bahamas, The | Data. https://data.worldbank.org/indicator/NY.GDP.MKTP.KD.ZG?locations=BS\n\n\n\n",
    "preview": "posts/2021-11-24-hurricanes-and-gdp-growth-in-the-bahamas/hurricanes-and-gdp-growth-in-the-bahamas_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2021-12-01T19:55:48-08:00",
    "input_file": {},
    "preview_width": 960,
    "preview_height": 384
  },
  {
    "path": "posts/2021-10-14-best-beaches/",
    "title": "My Favorite Beaches on Long Island",
    "description": "A fun intro to my life outside of Data Science",
    "author": [
      {
        "name": "Paloma Cartwright",
        "url": {}
      }
    ],
    "date": "2021-10-14",
    "categories": [
      "The Bahamas",
      "Long Island",
      "Beaches",
      "R",
      "tidyr",
      "ggplot",
      "wordcloud"
    ],
    "contents": "\nOkay so if you’ve been on this blogging journey with me from the beginning, you’ll know this blog post started out as just a list of my favorite beaches. But, this left me feeling a bit unsatisfied lol. After all, I am a data science student so I should include data right? Right! So, I polled my family and friends from home and asked them to rank the beaches from their most to least favorites and I am now redoing this blog post including data analysis. Yay me!\nIf you don’t know my background, I grew up in a tiny island on The Bahamas, Long Island, with a population of a little over 3,000 people. There were definitely both perks and downfalls (hello climate change and hurricanes) of this, but one of my greatest pleasures of growing up there was the fact that there were endless beaches for me to explore always.\nBeing on the ocean is my happy place and completing my senior year of undergrad at McGill University online from home was an unexpected gift for that stage in my life. I also spent a ton of time with my family which I wouldn’t have had the opportunity to do otherwise.\nThis blog post will feature my top 5 beaches (with photos of course). There will also be a surprise appearance of my mom’s swimming piggies. I hope you enjoy!\n\n\n\nMaking the list to decide on my favorites was initially a hard process, but since then I have taken my bias out and the list will now be based on the 12 friends that completed my survey for me. So below I will do some fun data tidying and wrangling and see where the analysis goes from there.\nWrangling my data\nI needed to clean it up first and then I decided to rename all of the columns so that they were shorter and easier to use later in my code. I also created a tribble with the total rating for each beach and will use that for my ranking of the beaches.\n\n\nbeaches_data <- read_csv(here(\"_posts\", \"2021-10-14-best-beaches\",\"beaches.csv\")) %>% \n  clean_names() %>% \n  rename(\"lowes\" = \"rate_lowes_beach\", \n         \"conch_point\" = \"rate_conch_point_beach\",\n         \"sand_bars\" = \"rate_the_sand_bars\", \n         \"blue_hole\" = \"rate_deans_blue_hole\", \n         \"gordons\" = \"rate_gordons_beach\", \n         \"fave\" = \"name_your_favourite_beach\")\n\n\n\ntotals <- tribble(\n  ~beach, ~total,\n  \"Lowe's Beach\", sum(beaches_data$lowes),\n  \"Conch Point Beach\", sum(beaches_data$conch_point), \n  \"The Sand Bars\", sum(beaches_data$sand_bars),\n  \"Dean's Blue Hole\", sum(beaches_data$blue_hole),\n  \"Gordon's Beach\", sum(beaches_data$gordons)\n)\n\ntotals <- totals %>% \n  arrange(total)\n\n\n\nNumber 5\nThe award for the least favorite beach among my family and friends goes to Conch Point Beach.\n(I’m salty about this because Conch Point Deserves to be higher)\nThis beach admittedly has a weird name, but its just a beach named after the channel that it borders, Conch Point. This has always been a favorite place of mine, but now even more so since my parents worked with members of the community to build cabanas on the beach and my mom trained the pigs that now live on the beach and play with you.\n\n\n\nIt is just so stunningly perfect, year round. It is only accessible by boat so it means I get a beach and boat day in one and I just love that for me.\n\n\n\nNumber 4\nLet’s see what my family gave me this time! The number 4 winner goes to Dean’s Blue Hole\nThis one is very reasonable. She had to make the list because she is world famous. Every year there are countless world records broken here because the Blue Hole is over 600 feet deep. The perfect place for a free-diving competition or if you’re me, to get your scuba diving certification.\n\n\n\n(Third Picture above from Vertical Blue)\nIf you grew up on Long Island, then you also know this is a perfect place for a lil adrenaline rush from jumping off of the cliff into the Blue Hole, just like my cousin is doing in the picture. Definitely a must do if you ever go to Long Island.\n\n\n\nNumber 3\nGordon’s Beach\nOkay so my friends just have bad taste, sorry guys. This beach deserves number 1 every time. Gordon’s Beach is at the Southern most end of Long Island, right off the end of the road. Just miles of untouched beauty. Literally takes my breath away everytime I see it and I’ve been going here my entire life. She is a stunner and worth the drive every time!\n\n\n\nThe Runner Up\nWhat do we have here? The Sand Bars\nSo when I did my ranking, the sand bars were ranked lower because they are only above water at low tides and only accessible by boat, so you do really have to time it right. Apparently that is not a deterrent for anyone, including me and it is a treat because when you do time it right?? Absolute stunner! I love it at the sandbars. You really do be feeling like you in the middle of nowhere. (That last sentence was very Bahamian, I do not apologize.)\n\n\n\nI mean just look at the content!! She truly speaks for herself.\n\n\nThe Winner\nAnd the top award (which does not surprise me) goes to… Lowe’s Beach.\nThis one has been a family fave for as long as I have been alive. This was definitely the beach of my toddler years and I have fond memories of it. My aunt sent me the pictures of me below and told me I should recreate it now, I have yet to do it but it was taken on Lowe’s Beach. My mom always spent summers on the beach everyday with me, my big brother and all of the cousins that could fit in the car. This beach was also probably where I learnt to swim.\n\n\n\nThis is a view of the stunning beach from above. It is this little pool thing that has a reef at the entrance that water flows through and over but feels a lil safer for children because they can’t go into the ocean.\n\n\n\nAt certain times in the year, the sand at this beach also has a pink tint, 10/10 rating. I love going to the beach with my friends here and we always have a good time.\n\n\n\nNo filter on any of these pictures because The Bahamas is THAT girl.\nSo after asking my friends for a ranking, I figured it was time for me to create my first !!WORD CLOUD!! I asked them all to write in the name of their favorite beach, on the list or not so I could make a fun little word cloud.\nI had to do some fun wrangling to ensure that there was no duplicate stuff in my word clouds but it mostly went well. Shoutout to my classmates Scout and Juliet for doing a word cloud in the blog post about our summer courses, y’all truly made my life easier for this and figuring it all out.\n\n\nbeaches_data <- beaches_data %>% \n  mutate(fave = tolower(fave))\n\nbeaches <- data.frame(table(beaches_data$\"fave\"))\n\nbeaches_df <- as.data.frame.matrix(beaches)\n\nbeaches_cloud <- ggplot(beaches_df, aes(label = Var1, size = Freq, color = Var1)) +\n  geom_text_wordcloud() +\n  scale_size_area(max_size = 10) +\n  theme(plot.title = element_text(size = 25),\n        panel.background = element_rect(fill = \"white\")) +\n  labs(title = \"Beach Beach Baby\")\n\nbeaches_cloud\n\n\n\n\nAdmittedly, my word cloud is not very interesting butttt it’s something and it is telling me that I probably should’ve included The Cape Beach. Here is a picture of that beaut.\n\nHope reading this post made your day better!\n\n\n\n",
    "preview": "posts/2021-10-14-best-beaches/img/DSC_0213.jpeg",
    "last_modified": "2021-11-03T18:24:49-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-29-mappractice/",
    "title": "Map Making",
    "description": "This is a blog post that is my journey on how to make maps.",
    "author": [
      {
        "name": "Paloma Cartwright",
        "url": {}
      }
    ],
    "date": "2021-09-29",
    "categories": [
      "R",
      "spData",
      "tmap"
    ],
    "contents": "\n\nContents\nLet’s Make Some Maps\ntmap basics\ntmap aesthetics\nColor Settings\n\n\nLet’s Make Some Maps\ntmap basics\nThis is a blog post about my process navigating chapter 8 in GeoComputation with R for EDS 223. I don’t know where this journey will take me, but I figured that I’d make a blog post about my process as I make some cool maps and learn how to use tmap.\nMaking a basic map of New Zealand with tmap. The New Zealand object comes from the sf data\ntm_polygons() combines both tm_fill() and tm_borders() so map_nz1 and map_nz2 below are the same.\n\n\nShow code\n\nmap_nz1 <- tm_shape(nz) +\n  tm_fill() + \n  tm_borders() \n\nmap_nz2 <- tm_shape(nz) + tm_polygons()\nmap_nz2\n\n\n\n\nCombining multiple layers\ntm_raster() plots a raster layer and the argument alpha is the transparency of that layer\n\n\nShow code\n\nmap_nz3 <- map_nz2 + tm_shape(nz_elev) +\n  tm_raster(alpha = 0.7) \nmap_nz3\n\n\n\n\nNew Zealand water addition\n\n\nShow code\n\nnz_water <- st_union(nz) %>% #returns a single geometry with resolved boundaries\n  st_buffer(22200) %>% #computes a buffer around this geometry\n  st_cast(to = \"LINESTRING\") #cast geometry to another type\n\nmap_nz4 <- map_nz3 + \n  tm_shape(nz_water) + tm_lines()\nmap_nz4\n\n\n\n\nAdding the height element to the map of New Zealand\n\n\nShow code\n\nmap_nz5 <- map_nz4 + \n  tm_shape(nz_height) + tm_dots()\n\nmap_nz5\n\n\n\n\nTo combine different maps using tmap in a similar way as you would use patchwork in ggplot you do the following:\n\n\nShow code\n\ntmap_arrange(map_nz3, map_nz4, map_nz5)\n\n\n\n\ntmap aesthetics\nThe common aesthetics for fill and border layers are color col , transparency alpha , line width lwd and line typelty.\n\n\nShow code\n\nmap1 <- tm_shape(nz) + tm_fill(col = \"green\")\nmap2 <- tm_shape(nz) + tm_fill(col = \"red\", alpha = 0.5)\nmap3 <- tm_shape(nz) + tm_borders(col = \"darkgrey\")\nmap4 <- tm_shape(nz) + tm_borders(lwd = 2)\nmap5 <- tm_shape(nz) + tm_borders(lty = 3)\nmap6 <- tm_shape(nz) + tm_fill(col = \"green\", alpha = 0.5) +\n  tm_borders(col = \"darkgrey\", lwd = 2, lty = 3)\ntmap_arrange(map1, map2, map3, map4, map5, map6)\n\n\n\n\nYou cannot use a column name in tmap like you can in R to set the aesthetic of a variable like color, but instead you have to put it in quotations. You can treat plot the same way as you would R though. Hopefully, I am understanding this correctly.\n\n\nShow code\n\n# tm_shape(nz) + tm_fill(col = nz$Land_area) This line fails\nplot(st_geometry(nz), col = nz$Land_area) # This works because plot has the same functionality as R\n\n\n\nShow code\n\ntm_shape(nz) + tm_fill(col = \"Land_area\") #The color aesthetic has to be in quotes here \n\n\n\n\nTo add a title in the legend of the aesthetic you are using, you define this in the same place as you define the aesthetic. expression() is used in the commented seciton below to add the special script for the squared kilometers. If you do not need fancy text, you can just put your title in quotes.\n\n\nShow code\n\n#legend_title = expression(\"Area (km\"^2*\")\") \nlegend_title = \"Area in Kilometers Squared\"\nmap_nza = tm_shape(nz) +\n  tm_fill(col = \"Land_area\", title = legend_title) + tm_borders(lwd = 1.5)\nmap_nza\n\n\n\n\nColor Settings\n\n\nShow code\n\ntm_shape(nz) + tm_polygons(col = \"Median_income\")\n\n\n\nShow code\n\nbreaks = c(0, 3, 4, 5) * 10000\ntm_shape(nz) + tm_polygons(col = \"Median_income\", breaks = breaks)\n\n\n\nShow code\n\ntm_shape(nz) + tm_polygons(col = \"Median_income\", n = 10)\n\n\n\nShow code\n\ntm_shape(nz) + tm_polygons(col = \"Median_income\", palette = \"viridis\")\n\n\n\n\nThis is all the map work I’ve done for the day! Stay tuned, maybe there will be more.\n\n\n\n",
    "preview": "posts/2021-09-29-mappractice/mappractice_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2021-11-25T10:24:55-08:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2021-08-17-eds-221-week-2-blog-post/",
    "title": "EDS 221 Week 2 Blog Post",
    "description": "A blog post containing some of the material and things we've done in EDS 221.",
    "author": [
      {
        "name": "Paloma Cartwright",
        "url": {}
      }
    ],
    "date": "2021-08-17",
    "categories": [
      "R",
      "tidyr"
    ],
    "contents": "\nI will edit this post and add in all of the required things throughout the week.\nThroughout EDS 221, we have done extensive work with programming techniques and one of the most fascinating ones for me was the tidyr functions pivot_wider and pivot_longer to tidy data so that it can be used later. It is always fun to see how data can be graphed using the various functions in R like ggplot.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-29T14:03:28-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-10-diamondsdataset/",
    "title": "Exploring the Diamonds Dataset",
    "description": "Using the diamonds dataset to explore ggplot functions and customization more.",
    "author": [
      {
        "name": "Paloma Cartwright",
        "url": {}
      }
    ],
    "date": "2021-08-10",
    "categories": [
      "R",
      "GGally"
    ],
    "contents": "\nUsing GGally and ggplot to Explore the Diamonds data set\nUsing ggplot\nCreating a Scatter Plot\nCreating a scatter plot of carat versus price of the diamonds data set.\n\n\n\nGenerally, as the carats increase, the price of the diamonds also increase.\nCreating a Histogram\nCreating a histogram of the carats of diamonds in the dataset\n\n\n\nUsing GGally\nThis outputs a really ridiculous set of graphs, but that is the purpose of the ggpairs function.\n\n\n\n\n\n\n",
    "preview": "posts/2021-08-10-diamondsdataset/images/diamonds.png",
    "last_modified": "2021-09-29T14:01:18-07:00",
    "input_file": {},
    "preview_width": 384,
    "preview_height": 451
  },
  {
    "path": "posts/2021-08-10-function/",
    "title": "Using `ggplot` to Explore Palmer Penguins Datasets",
    "description": "This blog post has graphs from the palmer penguins dataset.",
    "author": [
      {
        "name": "Paloma Cartwright",
        "url": {}
      }
    ],
    "date": "2021-08-10",
    "categories": [
      "R",
      "ggplot",
      "palmerpenguins"
    ],
    "contents": "\nExploring Palmer Penguins\nThis is a graph using ggplot to display the flipper length and body mass relation of the palmer penguins dataset.\n\n\n\n\n\n\n",
    "preview": "posts/2021-08-10-function/images/lter_penguins.png",
    "last_modified": "2021-09-29T14:02:25-07:00",
    "input_file": {},
    "preview_width": 1800,
    "preview_height": 1074
  },
  {
    "path": "posts/2021-08-10-hello/",
    "title": "My First Blog Post",
    "description": "First blog post for this website.",
    "author": [
      {
        "name": "Paloma Cartwright",
        "url": {}
      }
    ],
    "date": "2021-08-10",
    "categories": [],
    "contents": "\nThis is the first blog post ever added to my website. It does not say very much because it is just a tester to demonstrate how distill websites work and how you create blog posts. As the quarter goes on, I will be adding more informational blog posts to my website. If you made it this deep, I hope you are enjoying my website. I am very new to making websites in RStudio using Distill, so please be patient with me as I work the kinks out over the next few months.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-28T21:58:36-07:00",
    "input_file": {}
  }
]
